In [ ]:
import pandas as pd

df = pd.read_csv(C:\Users\Administrator\Downloads\data.csv"")
df

In [2]:
df.count()

EST                     31
Temperature             31
DewPoint                31
Humidity                31
Sea Level PressureIn    31
VisibilityMiles         31
WindSpeedMPH            28
PrecipitationIn         31
CloudCover              31
Events                   9
WindDirDegrees          31
dtype: int64

In [3]:
df.Events

0          NaN
1          NaN
2          NaN
3          NaN
4          NaN
5          NaN
6          NaN
7          NaN
8         Rain
9         Rain
10         NaN
11         NaN
12         NaN
13         NaN
14         NaN
15        Rain
16    Fog-Snow
17        Snow
18         NaN
19         NaN
20         NaN
21        Snow
22    Fog-Snow
23        Snow
24         NaN
25         NaN
26        Rain
27         NaN
28         NaN
29         NaN
30         NaN
Name: Events, dtype: object

In [4]:
df.Events.unique() # unique content with unique value in particular column

array([nan, 'Rain', 'Fog-Snow', 'Snow'], dtype=object)

In [5]:
df.Events.describe()

count        9
unique       3
top       Rain
freq         4
Name: Events, dtype: object

In [8]:
df.dtypes # show values in column

EST                      object
Temperature               int64
DewPoint                  int64
Humidity                  int64
Sea Level PressureIn    float64
VisibilityMiles           int64
WindSpeedMPH            float64
PrecipitationIn          object
CloudCover                int64
Events                   object
WindDirDegrees            int64
dtype: object

df.describe()

In [9]:
df.describe()

,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,CloudCover,WindDirDegrees
count,31.000000,31.000000,31.000000,31.000000,31.000000,28.000000,31.000000,31.000000
mean,34.677419,17.838710,51.677419,29.992903,9.193548,6.892857,3.129032,247.129032
std,7.639315,11.378626,11.634395,0.237237,1.939405,2.871821,2.629853,92.308086
min,20.000000,-3.000000,33.000000,29.520000,1.000000,2.000000,0.000000,34.000000
25%,29.000000,10.000000,44.500000,29.855000,9.000000,5.000000,1.000000,238.000000
50%,35.000000,18.000000,50.000000,30.010000,10.000000,6.500000,3.000000,281.000000
75%,39.500000,23.000000,55.000000,30.140000,10.000000,8.000000,4.500000,300.000000
max,50.000000,46.000000,78.000000,30.570000,10.000000,16.000000,8.000000,345.000000

In [11]:
df['Temperature'].max()

np.int64(50)

In [12]:
df.Temperature.count()

np.int64(31)

In [15]:
df['EST'][df['Events']=='Rain'] # to know which day is rain

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

In [21]:
df1 = df['Temperature']> 30
df1

0      True
1      True
2      True
3     False
4     False
5      True
6      True
7      True
8      True
9      True
10     True
11     True
12    False
13    False
14     True
15     True
16     True
17    False
18    False
19     True
20     True
21    False
22    False
23    False
24     True
25     True
26     True
27     True
28     True
29     True
30     True
Name: Temperature, dtype: bool

In [17]:
df1 = df['Temperature']> 30
df1
df1.sum() # total no of temp more than 30

np.int64(22)

In [18]:
df.WindSpeedMPH.isna()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9      True
10     True
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21     True
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
Name: WindSpeedMPH, dtype: bool

In [20]:
df.WindSpeedMPH.isna().sum()

np.int64(3)

In [22]:
lst = [10,20,30,40,50,60]
s = pd.Series(lst)
print(s,type(s))

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64 <class 'pandas.core.series.Series'>

In [24]:
l = [1,2,3]
ser = pd.Series(l,index=['first','second','third'])
print(ser)

first     1
second    2
third     3
dtype: int64

In [28]:
l = [1,2,3]
ser = pd.Series(l,index=['first','second','third'],name='c')
print(ser)

first     1
second    2
third     3
Name: c, dtype: int64

In [29]:
print(s.loc[0:3]) # to control range

0    10
1    20
2    30
3    40
dtype: int64

In [32]:
lst = [10,20,30,40,50,60]
s = pd.Series(lst,dtype='float')
#s = pd.Series(lst,dtype='int')
print(s,type(s))

0    10.0
1    20.0
2    30.0
3    40.0
4    50.0
5    60.0
dtype: float64 <class 'pandas.core.series.Series'>

In [33]:
s[3] # to get specified row

np.float64(40.0)

In [38]:
lst = [10,'rose',21.65,'Book']
s = pd.Series(lst,index=['stno','name','third','Mark'])
print(s)

stno        10
name      rose
third    21.65
Mark      Book
dtype: object

In [45]:
s["third"]

TypeError: list indices must be integers or slices, not str

In [46]:
lst = [[1,0,1,3],[1,2,3,4],[4,5,6,7],[0,0,0,0]]
df = pd.Series(lst)
print(df)

0    [1, 0, 1, 3]
1    [1, 2, 3, 4]
2    [4, 5, 6, 7]
3    [0, 0, 0, 0]
dtype: object

In [47]:
lst = [[10,'Rs'],[20,'2G'],[30,'3G'],[40,'4G']]
df = pd.DataFrame(lst)
print(df)

    0   1
0  10  Rs
1  20  2G
2  30  3G
3  40  4G

In [55]:
df.iloc[1:]

   num name
B   20   2G
C   30   3G
D   40   4G

In [49]:
df.iloc[1:3]

    0   1
1  20  2G
2  30  3G

In [53]:
lst = [[10,'Rs'],[20,'2G'],[30,'3G'],[40,'4G']]
df = pd.DataFrame(lst,columns= ['num','name'],index=['A','B','C','D'])
print(df)

   num name
A   10   Rs
B   20   2G
C   30   3G
D   40   4G

In [56]:
df.iloc[1:,]

   num name
B   20   2G
C   30   3G
D   40   4G

In [57]:
df.iloc[1 ::]

   num name
B   20   2G
C   30   3G
D   40   4G

In [60]:
tpl = (('Rose',20),('blue',10),('green',90))
df = pd.DataFrame(tpl, index=[1,'@',3],columns=['Name','Age'])
print(df)

    Name  Age
1   Rose   20
@   blue   10
3  green   90

In [62]:
#creating an obj Dataframe by using dict obj

dictdata = {'Names':["Rose","Lily","sun"],"subjects":["java","c","python"]}
print(dictdata)

{'Names': ['Rose', 'Lily', 'sun'], 'subjects': ['java', 'c', 'python']}

In [71]:

dictdata = {'Names':["Rose","Lily","sun"],"subjects":["java","c","python"]}
dictdata.values()
#print(dictdata)

dict_values([['Rose', 'Lily', 'sun'], ['java', 'c', 'python']])

In [65]:
df = pd.DataFrame(dictdata)
print(df)

  Names subjects
0  Rose     java
1  Lily        c
2   sun   python

In [66]:
df.shape

(3, 2)

In [69]:
df = pd.DataFrame(dictdata,index=[1,2,'e'])
print(df)

  Names subjects
1  Rose     java
2  Lily        c
e   sun   python

In [72]:
# creating obj with series of obj
l =[10,20,30,40]
sdata = pd.Series(l)
print(type(l))
print(sdata)

<class 'list'>
0    10
1    20
2    30
3    40
dtype: int64

In [74]:
df = pd .DataFrame(sdata,columns=['number'])
print(df)

   number
0      10
1      20
2      30
3      40

In [75]:
df.shape

(4, 1)

In [76]:
type(df)

pandas.core.frame.DataFrame

In [80]:
d1 = {'totalmark':[100,120,230],"extramark":[20,40,60]}
df = pd .DataFrame(d1,index=[1,2,3])
(df)

   totalmark  extramark
1        100         20
2        120         40
3        230         60

In [81]:
d1 = {'totalmark':[100,120,230],"extramark":[20,40,60]}
df = pd .DataFrame(d1,index=[1,2,3])
print(df)

   totalmark  extramark
1        100         20
2        120         40
3        230         60

In [82]:
#adding new column name to Dataframe
df['c3'] = df['totalmark']+df['extramark']
df

   totalmark  extramark   c3
1        100         20  120
2        120         40  160
3        230         60  290

In [83]:
df['sub'] = df['totalmark']-df['extramark']
df

   totalmark  extramark   c3  sub
1        100         20  120   80
2        120         40  160   80
3        230         60  290  170

In [84]:
df['new column'] =[1,2,3]
df

   totalmark  extramark   c3  sub  new column
1        100         20  120   80           1
2        120         40  160   80           2
3        230         60  290  170           3

In [101]:
df['Rollno'] = range(1,4)
df['name'] = ['A','g','e']
df

   Rollno  totalmark  extramark  new column   c3  sub name
1       1        100         20           1  120   80    A
2       2        120         40           2  160   80    g
3       3        230         60           3  290  170    e

In [92]:
#changing the column order
df = df[['Rollno','totalmark','extramark','new column','c3','sub']]
df

   Rollno  totalmark  extramark  new column   c3  sub
1       1        100         20           1  120   80
2       2        120         40           2  160   80
3       3        230         60           3  290  170

In [99]:
df1 = df['Rollno']
df1

1    1
2    2
3    3
Name: Rollno, dtype: int64

In [102]:
#SORTING THE DATAFRAME DATA

df = df.sort_values(['name'],ascending=True)
df

   Rollno  totalmark  extramark  new column   c3  sub name
1       1        100         20           1  120   80    A
3       3        230         60           3  290  170    e
2       2        120         40           2  160   80    g

In [105]:
df = df.drop['new column']

TypeError: 'method' object is not subscriptable

In [104]:
df = df.sort_values(['name'],ascending=False)
df

   Rollno  totalmark  extramark  new column   c3  sub name
2       2        120         40           2  160   80    g
3       3        230         60           3  290  170    e
1       1        100         20           1  120   80    A